springboot/bin/bench.log

##############################################
# Warm-up, concurrency 10
##############################################

==============================================
Spring Web, concurrency 10
http://localhost:8080/micro/api/ping
==============================================
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /micro/api/ping
Document Length:        24 bytes

Concurrency Level:      10
Time taken for tests:   3.916 seconds
Complete requests:      50000
Failed requests:        0
Keep-Alive requests:    49505
Total transferred:      8885645 bytes
HTML transferred:       1200000 bytes
Requests per second:    12766.70 [#/sec] (mean)
Time per request:       0.783 [ms] (mean)
Time per request:       0.078 [ms] (mean, across all concurrent requests)
Transfer rate:          2215.63 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     0    1   1.2      0      26
Waiting:        0    1   1.2      0      26
Total:          0    1   1.2      0      26

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      1
  75%      1
  80%      1
  90%      1
  95%      2
  98%      4
  99%      7
 100%     26 (longest request)

==============================================
Spring Webflux, concurrency 10
http://localhost:8080/micro/api/ping/flux
==============================================
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /micro/api/ping/flux
Document Length:        24 bytes

Concurrency Level:      10
Time taken for tests:   5.000 seconds
Complete requests:      45514
Failed requests:        0
Keep-Alive requests:    45064
Total transferred:      8088442 bytes
HTML transferred:       1092336 bytes
Requests per second:    9102.68 [#/sec] (mean)
Time per request:       1.099 [ms] (mean)
Time per request:       0.110 [ms] (mean, across all concurrent requests)
Transfer rate:          1579.75 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     0    1   1.9      1      62
Waiting:        0    1   1.9      1      62
Total:          0    1   1.9      1      62

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      2
  95%      3
  98%      7
  99%     10
 100%     62 (longest request)

==============================================
Vert.x, concurrency 10
http://localhost:8090/micro/api/ping
==============================================
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8090

Document Path:          /micro/api/ping
Document Length:        24 bytes

Concurrency Level:      10
Time taken for tests:   0.599 seconds
Complete requests:      50000
Failed requests:        0
Keep-Alive requests:    50000
Total transferred:      5950000 bytes
HTML transferred:       1200000 bytes
Requests per second:    83486.67 [#/sec] (mean)
Time per request:       0.120 [ms] (mean)
Time per request:       0.012 [ms] (mean, across all concurrent requests)
Transfer rate:          9702.06 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     0    0   0.2      0      11
Waiting:        0    0   0.2      0      11
Total:          0    0   0.2      0      11

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      0
  99%      0
 100%     11 (longest request)

##############################################
# Benchmark, concurrency 1
##############################################

==============================================
Spring Web, concurrency 1
http://localhost:8080/micro/api/ping
==============================================
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /micro/api/ping
Document Length:        24 bytes

Concurrency Level:      1
Time taken for tests:   5.000 seconds
Complete requests:      26696
Failed requests:        0
Keep-Alive requests:    26430
Total transferred:      4744174 bytes
HTML transferred:       640704 bytes
Requests per second:    5339.10 [#/sec] (mean)
Time per request:       0.187 [ms] (mean)
Time per request:       0.187 [ms] (mean, across all concurrent requests)
Transfer rate:          926.58 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     0    0   0.3      0      19
Waiting:        0    0   0.3      0      19
Total:          0    0   0.3      0      19

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      0
  99%      0
 100%     19 (longest request)

==============================================
Spring Webflux, concurrency 1
http://localhost:8080/micro/api/ping/flux
==============================================
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /micro/api/ping/flux
Document Length:        24 bytes

Concurrency Level:      1
Time taken for tests:   5.001 seconds
Complete requests:      16781
Failed requests:        0
Keep-Alive requests:    16614
Total transferred:      2982175 bytes
HTML transferred:       402744 bytes
Requests per second:    3355.84 [#/sec] (mean)
Time per request:       0.298 [ms] (mean)
Time per request:       0.298 [ms] (mean, across all concurrent requests)
Transfer rate:          582.39 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     0    0   0.3      0      13
Waiting:        0    0   0.3      0      13
Total:          0    0   0.3      0      13

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      0
  99%      0
 100%     13 (longest request)

==============================================
Vert.x, concurrency 1
http://localhost:8090/micro/api/ping
==============================================
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8090

Document Path:          /micro/api/ping
Document Length:        24 bytes

Concurrency Level:      1
Time taken for tests:   3.068 seconds
Complete requests:      50000
Failed requests:        0
Keep-Alive requests:    50000
Total transferred:      5950000 bytes
HTML transferred:       1200000 bytes
Requests per second:    16297.11 [#/sec] (mean)
Time per request:       0.061 [ms] (mean)
Time per request:       0.061 [ms] (mean, across all concurrent requests)
Transfer rate:          1893.90 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     0    0   0.1      0      12
Waiting:        0    0   0.1      0      12
Total:          0    0   0.1      0      12

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      0
  99%      0
 100%     12 (longest request)

##############################################
# Benchmark, concurrency 100
##############################################

==============================================
Spring Web, concurrency 100
http://localhost:8080/micro/api/ping
==============================================
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /micro/api/ping
Document Length:        24 bytes

Concurrency Level:      100
Time taken for tests:   3.588 seconds
Complete requests:      50000
Failed requests:        0
Keep-Alive requests:    49559
Total transferred:      8887211 bytes
HTML transferred:       1200000 bytes
Requests per second:    13935.60 [#/sec] (mean)
Time per request:       7.176 [ms] (mean)
Time per request:       0.072 [ms] (mean, across all concurrent requests)
Transfer rate:          2418.92 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       7
Processing:     0    7   5.1      7      62
Waiting:        0    7   5.1      7      62
Total:          0    7   5.1      7      62

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      8
  75%      9
  80%     10
  90%     13
  95%     17
  98%     21
  99%     24
 100%     62 (longest request)

==============================================
Spring Webflux, concurrency 100
http://localhost:8080/micro/api/ping/flux
==============================================
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /micro/api/ping/flux
Document Length:        24 bytes

Concurrency Level:      100
Time taken for tests:   5.004 seconds
Complete requests:      46307
Failed requests:        0
Keep-Alive requests:    45895
Total transferred:      8230698 bytes
HTML transferred:       1111368 bytes
Requests per second:    9254.61 [#/sec] (mean)
Time per request:       10.805 [ms] (mean)
Time per request:       0.108 [ms] (mean, across all concurrent requests)
Transfer rate:          1606.38 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0      12
Processing:     0   11   8.9     10     143
Waiting:        0   11   8.9     10     143
Total:          0   11   8.9     10     143

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     12
  75%     14
  80%     15
  90%     19
  95%     24
  98%     34
  99%     45
 100%    143 (longest request)

==============================================
Vert.x, concurrency 100
http://localhost:8090/micro/api/ping
==============================================
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8090

Document Path:          /micro/api/ping
Document Length:        24 bytes

Concurrency Level:      100
Time taken for tests:   0.773 seconds
Complete requests:      50000
Failed requests:        0
Keep-Alive requests:    50000
Total transferred:      5950000 bytes
HTML transferred:       1200000 bytes
Requests per second:    64707.16 [#/sec] (mean)
Time per request:       1.545 [ms] (mean)
Time per request:       0.015 [ms] (mean, across all concurrent requests)
Transfer rate:          7519.68 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       3
Processing:     0    2   1.1      1      15
Waiting:        0    2   1.1      1      15
Total:          0    2   1.1      1      15

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      2
  80%      2
  90%      2
  95%      2
  98%      3
  99%      5
 100%     15 (longest request)

##############################################
# Benchmark, concurrency 1000
##############################################

==============================================
Spring Web, concurrency 1000
http://localhost:8080/micro/api/ping
==============================================
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /micro/api/ping
Document Length:        24 bytes

Concurrency Level:      1000
Time taken for tests:   3.256 seconds
Complete requests:      50000
Failed requests:        0
Keep-Alive requests:    49990
Total transferred:      8899710 bytes
HTML transferred:       1200000 bytes
Requests per second:    15358.52 [#/sec] (mean)
Time per request:       65.110 [ms] (mean)
Time per request:       0.065 [ms] (mean, across all concurrent requests)
Transfer rate:          2669.66 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.9      0      34
Processing:     0   64  41.9     60     623
Waiting:        0   64  41.9     60     623
Total:          0   64  42.2     60     623

Percentage of the requests served within a certain time (ms)
  50%     60
  66%     73
  75%     80
  80%     85
  90%    104
  95%    126
  98%    167
  99%    201
 100%    623 (longest request)

==============================================
Spring Webflux, concurrency 1000
http://localhost:8080/micro/api/ping/flux
==============================================
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /micro/api/ping/flux
Document Length:        24 bytes

Concurrency Level:      1000
Time taken for tests:   5.001 seconds
Complete requests:      46560
Failed requests:        0
Keep-Alive requests:    46560
Total transferred:      8287680 bytes
HTML transferred:       1117440 bytes
Requests per second:    9310.72 [#/sec] (mean)
Time per request:       107.403 [ms] (mean)
Time per request:       0.107 [ms] (mean, across all concurrent requests)
Transfer rate:          1618.47 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   8.8      0      78
Processing:     0  103  47.8     98     635
Waiting:        0  103  47.8     98     635
Total:          0  105  47.9     99     635

Percentage of the requests served within a certain time (ms)
  50%     99
  66%    114
  75%    124
  80%    130
  90%    160
  95%    184
  98%    235
  99%    270
 100%    635 (longest request)

==============================================
Vert.x, concurrency 1000
http://localhost:8090/micro/api/ping
==============================================
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8090

Document Path:          /micro/api/ping
Document Length:        24 bytes

Concurrency Level:      1000
Time taken for tests:   0.909 seconds
Complete requests:      50000
Failed requests:        0
Keep-Alive requests:    50000
Total transferred:      5950000 bytes
HTML transferred:       1200000 bytes
Requests per second:    54995.94 [#/sec] (mean)
Time per request:       18.183 [ms] (mean)
Time per request:       0.018 [ms] (mean, across all concurrent requests)
Transfer rate:          6391.13 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   3.1      0      77
Processing:     5   11   3.2     10      27
Waiting:        5   11   3.2     10      27
Total:          5   12   5.2     10      99

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     11
  75%     11
  80%     12
  90%     16
  95%     17
  98%     23
  99%     42
 100%     99 (longest request)